# FramingShapeClassification Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FramingShapeClassification Property
ParameterTypeId Class See Also
---
"Framing Shape"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FramingShapeClassification { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FramingShapeClassification As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FramingShapeClassification {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace